; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-30)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 30
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 24 of 30
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 30
4. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 25 of 30
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 30
6. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 25 of 30
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 30
8. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 26 of 30
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 30
10. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 26 of 30
11. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 26 of 30
12. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 26 of 30
13. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 27 of 30
14. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 27 of 30
15. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 27 of 30
16. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 27 of 30
17. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 27 of 30
18. (drop ball23 room4 left)
   deleted: (carry ball23 left)
   added: (at ball23 room4) (free left)
   goals met: 28 of 30
19. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 30
20. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 28 of 30
21. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 28 of 30
22. (drop ball22 room4 left)
   deleted: (carry ball22 left)
   added: (at ball22 room4) (free left)
   goals met: 29 of 30
23. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 29 of 30
24. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 29 of 30
25. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 29 of 30
26. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 30 of 30
